Revit 2026 API

# DuctSettingsOvalDuctSizeSuffix Property

---

The oval duct size suffix string.

**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string OvalDuctSizeSuffix { get; set; }
```
```vb
Public Property OvalDuctSizeSuffix As String
	Get
	Set
```
```cpp
public:
property String^ OvalDuctSizeSuffix {
	String^ get ();
	void set (String^ value);
}
```
```fsharp
member OvalDuctSizeSuffix : string with get, set
```

#### Property Value

String

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |

#### Reference

DuctSettings Class

Autodesk.Revit.DB.Mechanical Namespace